Documents/КорректировкаПоступления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КорректировкаПоступления</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СерииНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДоИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРеализации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КорректировкаПоступления/Ext/ManagerModule.bsl
&После("ЗаполнитьПоДокументу")
Процедура УУ_ЗаполнитьПоДокументу(Объект)

	ЗаполнитьСерииИзДокументаОснования(Объект.ДокументПоступления, Объект.Товары, Объект.СерииНоменклатуры);
	//Если сабОбщегоНазначенияПовтИсп.ПолучитьСерийныйУчет() Тогда
	//	Если ТипЗнч(Объект.ДокументПоступления) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
	//		ИЛИ ТипЗнч(Объект.ДокументПоступления) = Тип("ДокументСсылка.КорректировкаПоступления")
	//		ИЛИ ТипЗнч(Объект.ДокументПоступления) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
	//		Запрос = Новый Запрос;
	//		Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	ДокументОснованиеТовары.НомерСтроки КАК НомерСтроки,
	//		|	ДокументОснованиеТовары.Номенклатура КАК Номенклатура,
	//		|	ДокументОснованиеТовары.СерияНоменклатуры КАК СерияНоменклатуры
	//		|ИЗ " + Объект.ДокументПоступления.Метаданные().ПолноеИмя() + ".Товары КАК ДокументОснованиеТовары
	//		|ГДЕ
	//		|	ДокументОснованиеТовары.Ссылка = &Ссылка";
	//		
	//		Запрос.УстановитьПараметр("Ссылка",  Объект.ДокументПоступления);
	//		
	//		РезультатЗапроса = Запрос.Выполнить();
	//		
	//		Выборка = РезультатЗапроса.Выбрать();
	//		
	//		Для Каждого СтрокаТЧТоваты Из Объект.Товары Цикл
	//			Выборка.Сбросить();
	//			СтрутураДляПоискаСтроки = Новый Структура("НомерСтроки, Номенклатура",СтрокаТЧТоваты.НомерСтроки,СтрокаТЧТоваты.Номенклатура);
	//			Если Выборка.НайтиСледующий(СтрутураДляПоискаСтроки) Тогда
	//				СтрокаТЧТоваты.СерияНоменклатуры = 	Выборка.СерияНоменклатуры;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		Объект.СерииНоменклатуры.Очистить();
	//		Для Каждого СтрокаТЧСерииНоменклатуры Из Объект.ДокументПоступления.СерииНоменклатуры Цикл
	//			НоваяСтрокаТЧСерииНоменклатуры = Объект.СерииНоменклатуры.Добавить();
	//			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧСерииНоменклатуры,СтрокаТЧСерииНоменклатуры);
	//			НоваяСтрокаТЧСерииНоменклатуры.КоличествоДоИзменения = СтрокаТЧСерииНоменклатуры.Количество;
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСерииИзДокументаОснования(ДокументОснование, ОсновнаяТЧ, СерииНоменклатурыТЧ) Экспорт
	
	Если сабОбщегоНазначенияПовтИсп.ПолучитьСерийныйУчет() Тогда
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
			ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаПоступления")
			ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДокументОснованиеТовары.НомерСтроки КАК НомерСтроки,
			|	ДокументОснованиеТовары.Номенклатура КАК Номенклатура,
			|	ДокументОснованиеТовары.СерияНоменклатуры КАК СерияНоменклатуры
			|ИЗ " + ДокументОснование.Метаданные().ПолноеИмя() + ".Товары КАК ДокументОснованиеТовары
			|ГДЕ
			|	ДокументОснованиеТовары.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка",  ДокументОснование);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Для Каждого СтрокаТЧТоваты Из ОсновнаяТЧ Цикл
				Выборка.Сбросить();
				СтрутураДляПоискаСтроки = Новый Структура("НомерСтроки, Номенклатура",СтрокаТЧТоваты.НомерСтроки,СтрокаТЧТоваты.Номенклатура);
				Если Выборка.НайтиСледующий(СтрутураДляПоискаСтроки) Тогда
					СтрокаТЧТоваты.СерияНоменклатуры = 	Выборка.СерияНоменклатуры;
				КонецЕсли;
			КонецЦикла;
			
			СерииНоменклатурыТЧ.Очистить();
			Для Каждого СтрокаТЧСерииНоменклатуры Из ДокументОснование.СерииНоменклатуры Цикл
				НоваяСтрокаТЧСерииНоменклатуры = СерииНоменклатурыТЧ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧСерииНоменклатуры,СтрокаТЧСерииНоменклатуры);
				НоваяСтрокаТЧСерииНоменклатуры.КоличествоДоИзменения = СтрокаТЧСерииНоменклатуры.Количество;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
